{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "trainable": true, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "normal", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "normal", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "normal", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "normal", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "units": 128, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "units": 58, "bias_constraint": null, "bias_regularizer": null}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}