{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "filters": 4, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "filters": 4, "activation": "relu", "use_bias": true, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "filters": 4, "activation": "relu", "use_bias": true, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "filters": 8, "activation": "relu", "use_bias": true, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "filters": 8, "activation": "relu", "use_bias": true, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "filters": 8, "activation": "relu", "use_bias": true, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 600, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}