{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 32, "batch_input_shape": [null, 32, 32, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 32, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_3"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 64, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "units": 1024, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "units": 600, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2"}}], "name": "sequential_1"}, "keras_version": "2.2.4"}